ua1arn/hftrx/boards/arm_stm32h7xx_tqfp176_ctlstyle_storch_v6_idenis.h
		// ST LM235Z
		#define THERMOSENSOR_UPPER		402	// 4020 Ohm - верхний резистор делителя датчика температуры
		#define THERMOSENSOR_LOWER		95	// 950 Ohm - нижний резистор
		#define THERMOSENSOR_OFFSET 	(- 2730)		// 2.98 volt = 25 Celsius, 10 mV/C
		#define THERMOSENSOR_DENOM	 	1			// миливольты к десятым долям градуса 2.98 volt = 25 Celsius

	#else


		#define WITHREFSENSOR	1		/* измерение по выделенному каналу АЦП опорного напряжения */


		#if WITHREFSENSOR
			VREFIX = 17,		// Reference voltage
		#endif /* WITHREFSENSOR */
		#if WITHTEMPSENSOR
			TEMPIX = 16,
		#endif /* WITHTEMPSENSOR */
		#if WITHVOLTLEVEL
			VOLTSOURCE = 8,		// PB0 Средняя точка делителя напряжения, для АКБ
		#endif /* WITHVOLTLEVEL */

		#if WITHPOTIFGAIN
			POTIFGAIN = 3,		// PA2 IF GAIN
		#endif /* WITHPOTIFGAIN */
		#if WITHPOTAFGAIN
			POTAFGAIN = 7,		// PA7 AF GAIN
		#endif /* WITHPOTAFGAIN */

		#if WITHPOTWPM
			POTWPM = 6,			// PA6 потенциометр управления скоростью передачи в телеграфе
		#endif /* WITHPOTWPM */
		#if WITHPOTPOWER
			POTPOWER = 6,			// регулировка мощности
		#endif /* WITHPOTPOWER */

		#if WITHTHERMOLEVEL
			XTHERMOIX = 9,		// PB1 External thermo sensor ST LM235Z
		#endif /* WITHTHERMOLEVEL */

		#if WITHCURRLEVEL
			PASENSEIX = 2,		// PA2 PA current sense - ACS712-05 chip
			VOLTMRRIX = BOARD_ADCMRRIN(1),	// кеш - индекc не должен повторяться в конфигурации
		#endif /* WITHCURRLEVEL */

		#if WITHSWRMTR
			FWD = 14, REF = 15,	// PC5	SWR-meter
			REFMRRIX = BOARD_ADCMRRIN(2),
			FWDMRRIX = BOARD_ADCMRRIN(3),
			PWRMRRIX = BOARD_ADCMRRIN(4),
		#endif /* WITHSWRMTR */

		#define VOLTLEVEL_UPPER		47	// 4.7 kOhm - верхний резистор делителя датчика напряжения
		#define VOLTLEVEL_LOWER		10	// 1 kOhm - нижний резистор


		// ST LM235Z
		#define THERMOSENSOR_UPPER		47	// 4.7 kOhm - верхний резистор делителя датчика температуры
		#define THERMOSENSOR_LOWER		10	// 1 kOhm - нижний резистор
		#define THERMOSENSOR_OFFSET 	(- 2730)		// 2.98 volt = 25 Celsius, 10 mV/C
		#define THERMOSENSOR_DENOM	 	1			// миливольты к десятым долям градуса 2.98 volt = 25 Celsius

	#endif
	};

	/* кеширование днных */
	enum
	{
		KI0 = 10, KI1 = 11, KI2 = 12, KI3 = 0, KI4 = 1	// клавиатура
	};

	#define KI_COUNT 5	// количество используемых под клавиатуру входов АЦП
	#define KI_LIST	KI4, KI3, KI2, KI1, KI0,	// инициализаторы для функции перекодировки

#endif /* ARM_STM32H7XX_TQFP176_CTLSTYLE_STORCH_V6_H_INCLUDED */
